# St7SetTHAInitial

Assigns the initial conditions file to be used for transient heat analysis.

long St7SetTHAInitial(long uID, char* FileName, long CaseNum)

Input Parameters

uID

Strand7 model file ID.

FileName

Full path and name for the initial conditions file.

CaseNum

Result case number within FileName to be used as the initial conditions.